kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_RN4020_Set_CTS(int value)
{
#ifdef ENABLE_RN4020
    return (HAL_GPIO_WritePin(GPIOA,GPIO_PIN_2, value ? GPIO_PIN_SET : GPIO_PIN_RESET );
#endif
}

void HAL_RN4020_Set_CMD_MLDP(int value)
{
#ifdef ENABLE_RN4020
    return (HAL_GPIO_WritePin(GPIOC,GPIO_PIN_2, value ? GPIO_PIN_SET : GPIO_PIN_RESET );
#endif
}

void HAL_SPI_Comm_Ready_Assert() /* Active:  Low */
{
#ifdef ENABLE_SPI_COMM_READY_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_SPI_Comm_Ready_GPIO_Port, NAVX_2_RPI_SPI_Comm_Ready_Pin, GPIO_PIN_RESET);
#endif
}

void HAL_SPI_Comm_Ready_Deassert()
{
#ifdef ENABLE_SPI_COMM_READY_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_SPI_Comm_Ready_GPIO_Port, NAVX_2_RPI_SPI_Comm_Ready_Pin, GPIO_PIN_SET);
#endif
}

void HAL_CAN_Int_Assert()
{
#ifdef CAN_INTERRUPT
	/* TODO */
#endif
}

void HAL_CAN_Int_Deassert()
{
#ifdef CAN_INTERRUPT
	/* TODO */
#endif
}

void HAL_AHRS_Int_Assert()
{
#ifdef AHRS_INTERRUPT
	/* TODO */
#endif
}

void HAL_AHRS_Int_Deassert()
{
#ifdef AHRS_INTERRUPT
	/* TODO */
#endif
}

#ifdef ENABLE_IOCX

typedef enum  {
	INT_EXTI,
	INT_SWED,
	INT_NONE
} GPIO_INTERRUPT_TYPE;

typedef struct {
	GPIO_TypeDef *p_gpio;
	uint16_t pin;
	uint8_t timer_index;
	uint8_t channel_index;
	GPIO_INTERRUPT_TYPE interrupt_type;
	uint8_t interrupt_index;
	uint8_t alt_function;
} GPIO_Channel;

#define MAX_VALID_STM32_AF_VALUE 0x0F
#define GPIO_AF_SW_RESET_COUNTER (MAX_VALID_STM32_AF_VALUE + 1)

static GPIO_Channel gpio_channels[IOCX_NUM_GPIOS] =
{
	{PWM_GPIO1_GPIO_Port, 	PWM_GPIO1_Pin, 	4,  0, INT_EXTI, 0,  GPIO_AF2_TIM5},
	{PWM_GPIO2_GPIO_Port, 	PWM_GPIO2_Pin, 	4,  1, INT_EXTI, 1,  GPIO_AF2_TIM5},
	{PWM_GPIO3_GPIO_Port, 	PWM_GPIO3_Pin, 	5,  0, INT_EXTI, 2,  GPIO_AF3_TIM9},
	{PWM_GPIO4_GPIO_Port, 	PWM_GPIO4_Pin, 	5,  1, INT_EXTI, 3,  GPIO_AF3_TIM9},
	{QE1_IDX_GPIO_Port, 	QE1_IDX_Pin, 	0, -1, INT_NONE, -1, GPIO_AF_SW_RESET_COUNTER},
	{QE1_A_GPIO_Port, 		QE1_A_Pin, 		0,  0, INT_EXTI, 4,  GPIO_AF1_TIM1},
	{QE1_B_GPIO_Port, 		QE1_B_Pin, 		0,  1, INT_SWED, 5,  GPIO_AF1_TIM1},
	{QE2_IDX_GPIO_Port, 	QE2_IDX_Pin, 	1, -1, INT_NONE, -1, GPIO_AF_SW_RESET_COUNTER},
	{QE2_A_GPIO_Port, 		QE2_A_Pin, 		1,  0, INT_EXTI, 6,  GPIO_AF1_TIM2},
	{QE2_B_GPIO_Port, 		QE2_B_Pin, 		1,  1, INT_SWED, 7,  GPIO_AF1_TIM2},
	{QE3_IDX_GPIO_Port, 	QE3_IDX_Pin, 	2, -1, INT_NONE, -1, GPIO_AF_SW_RESET_COUNTER},
	{QE3_A_GPIO_Port, 		QE3_A_Pin, 		2,  0, INT_SWED, 8,  GPIO_AF2_TIM3},
	{QE3_B_GPIO_Port, 		QE3_B_Pin, 		2,  1, INT_SWED, 9,  GPIO_AF2_TIM3},
	{QE4_IDX_GPIO_Port, 	QE4_IDX_Pin, 	3, -1, INT_NONE, -1, GPIO_AF_SW_RESET_COUNTER},
	{QE4_A_GPIO_Port, 		QE4_A_Pin, 		3,  0, INT_EXTI, 10, GPIO_AF2_TIM5},
	{QE4_B_GPIO_Port, 		QE4_B_Pin, 		3,  1, INT_EXTI, 11, GPIO_AF2_TIM5},
};

#define NUM_GPIO_EXTI_INTERRUPTS 			8
#define NUM_GPIO_SWED_INTERRUPTS 			4
#define NUM_ANALOG_TRIGGER_INTERRUPTS 		4

#define EXTI_INTERRUPT_BIT_MASK				0x0C5F
#define SWED_INTERRUPT_BIT_MASK		    	0x03A0
#define ANALOG_TRIGGER_INTERRUPT_BIT_MASK	0xF000

/* Software Edge Detector Configuration Section */

typedef struct {
	volatile uint32_t *p_GpioInputDataReg;
	uint32_t last_masked_data;
	uint32_t gpio_input_mask;
	IOCX_GPIO_INTERRUPT interrupt_mode;
	uint32_t interrupt_bit;
} SoftwareEdgeDetector;

SoftwareEdgeDetector *p_edge_detector = 0;
uint32_t edge_detector_int_bits = 0;
uint8_t edge_detector_count = 0;

void HAL_IOCX_Init()
{
	int swed_count = 0;
	int i;
	for (i = 0; i < sizeof(gpio_channels)/sizeof(gpio_channels[0]); i++) {
		if (gpio_channels[i].interrupt_type == INT_SWED) {
			swed_count++;
		}
	}
	if(swed_count > 0) {
		edge_detector_count = swed_count;
		int swed_index = 0;
		p_edge_detector =
			(SoftwareEdgeDetector *)malloc(swed_count * sizeof(SoftwareEdgeDetector));
		for (i = 0; i < sizeof(gpio_channels)/sizeof(gpio_channels[0]); i++) {
			if (gpio_channels[i].interrupt_type == INT_SWED) {
				p_edge_detector[swed_index].p_GpioInputDataReg =
					&gpio_channels[i].p_gpio->IDR;
				p_edge_detector[swed_index].last_masked_data = 0;
				p_edge_detector[swed_index].gpio_input_mask =
					gpio_channels[i].pin;
				p_edge_detector[swed_index].interrupt_mode = GPIO_INTERRUPT_DISABLED;
				p_edge_detector[swed_index].interrupt_bit = (1 << i);
				edge_detector_int_bits |= p_edge_detector[swed_index].interrupt_bit;
			}
		}
	}
}

/* IOCX GPIO Interrupt Generation:
 *
 * Each of the 16 IOCX GPIO Pins (12 Digital + 4 Analog when Triggers are Used)
 * may be optionally configured to generate an interrupt.  This is managed
 * by a simple mechanism consisting of:
 *
 * - Interrupt Mask
 * - Interrupt Status
 * - Interrupt Assertion GPIO Pin (Active Low)
 *
 * Three separate interrupt "edge detection" methods are used:
 *
 * 1) IOCX Hardware Interrupts:
 *
 * An ISR handles STM32 EXTI interrupts on configured GPIO edges.
 *
 * 2) IOCX Software Edge Detector:
 *
 * NOTE:  W/a layout change forcing the 12 GPIOs onto unique channels, all
 * but 1 of the Software Edge Detector channels can be moved to HW Interrupts.
 *
 * STM32's NVIC only allows one interrupt from any of the 16 GPIO Channels.
 * However, there are 8 possible banks (A-H) whose inputs are muxed.
 * Therefore, whenever interrupts are required from GPIO Pins which share
 * the same GPIO Channel, interrupt handling is only supported on one.
 *
 * A "Software Edge Detector" mechanism is provided to detect edges on
 * these "shared GPIO Channels", and to optionally generate a GPIO
 * Interrupt when edges occur.
 *
 * Note:  The "Software Edge Detector" executes once every millisecond from
 * the Systick interrupt handler.  This must be high performance to avoid
 * impacting overall STM32 firmware performance.
 *
 * 3) Analog Triggering:
 *
 * The VMX Analog Triggers may be used to detect edges on any of the
 * VMX Analog Inputs, and are implemented external to this file. An
 * interface is provided allowing GPIO Interrupt Assertion/Deassertion
 * in these cases.
 */

static volatile uint32_t int_status = 0;  /* Todo:  Review Race Conditions */
static volatile uint32_t int_mask = 0; /* Todo:  Review Race Conditions */
static const volatile uint32_t *int_request_gpio_bank = &GPIOC->ODR; /* Todo: get symbol from map? */
static const uint32_t int_request_bit = GPIO_PIN_8; /* Todo:  get symbol from map? */

